/*
 * def645.h
 *
 *  Created on: 2014-4-16
 *      Author: Administrator
 */

#ifndef DEF645_H_
#define DEF645_H_

//////////与systema.cfg内部运行参数有关,systema.cfg配置更改,相应的进行调整
#define  CjDealIndex		1			//cjdeal程序索引
#define  CjCommIndex		2			//cjcomm程序索引


typedef struct
{
	INT8U index;
	INT8U dataflag[4];
}dataFlagInfo;


//static dataFlagInfo dataFlag[] = {{1, {0x00,0x00,0x01,0x00}},//正向有功总
//									{2, {0x00,0x01,0x01,0x00}},//正向有功1费率
//									{3, {0x00,0x02,0x01,0x00}},//正向有功2费率
//									{4, {0x00,0x03,0x01,0x00}},//正向有功3费率
//									{5, {0x00,0x04,0x01,0x00}},//正向有功4费率
//									{6, {0x00,0xff,0x01,0x00}},//正向有功数据块
//
//									{7, {0x00,0x00,0x02,0x00}},//反向有功总
//									{8, {0x00,0x01,0x02,0x00}},//反向有功1费率
//									{9, {0x00,0x02,0x02,0x00}},//反向有功2费率
//									{10, {0x00,0x03,0x02,0x00}},//反向有功3费率
//									{11, {0x00,0x04,0x02,0x00}},//反向有功4费率
//									{12, {0x00,0xff,0x02,0x00}},//反向有功数据块
//
//									{13, {0x01,0x02,0x00,0x04}},//年时区表数
//									{14, {0x02,0x02,0x00,0x04}},//日时段表数
//									{15, {0x03,0x02,0x00,0x04}},//日时段数
//									{16, {0x00,0x00,0x01,0x04}},//第一套时区表数据
//									{17, {0x01,0x00,0x01,0x04}},//第一套第1日时段表数据（费率时段）
//									{18, {0x02,0x00,0x01,0x04}},//第一套第2日时段表数据（费率时段）
//									{19, {0x03,0x00,0x01,0x04}},//第一套第3日时段表数据（费率时段）
//									{20, {0x04,0x00,0x01,0x04}},//第一套第4日时段表数据（费率时段）
//									{21, {0x05,0x00,0x01,0x04}},//第一套第5日时段表数据（费率时段）
//									{22, {0x06,0x00,0x01,0x04}},//第一套第6日时段表数据（费率时段）
//									{23, {0x07,0x00,0x01,0x04}},//第一套第7日时段表数据（费率时段）
//									{24, {0x08,0x00,0x01,0x04}},//第一套第8日时段表数据（费率时段）
//									};

//static dataFlagInfo dataFlag_2d[] = {{1, {0x01,0x00,0x00,0x05}},//3A校表
//									{2, {0xff,0xff,0xff,0xff}},//1.5A校表
//									{3, {0xff,0xff,0xff,0xff}},//0.15A校表
//									{4, {0x02,0x00,0x00,0x05}},//0.3A校表
//									};

static dataFlagInfo dataFlag_2d[] = {{1, {0x02,0x01,0x00,0x05}},//3A校表
									{2, {0x01,0x00,0x00,0x05}},//1.5A校表
									{3, {0x02,0x00,0x00,0x05}},//0.15A校表
									{4, {0x03,0x01,0x00,0x05}},//0.3A校表
									};

static dataFlagInfo dataFlag_3d[] = {{1, {0x02,0x01,0x00,0x05}},//3A校表
									{2, {0x01,0x00,0x00,0x05}},//1.5A校表
									{3, {0x02,0x00,0x00,0x05}},//0.15A校表
									{4, {0x03,0x01,0x00,0x05}},//0.3A校表
//									{4, {0x03,0x00,0x00,0x05}},//需量清零
//									{5, {0x01,0x01,0x00,0x04}},//对时
									};
static dataFlagInfo dataFlag_4d[] = {{1, {0x07,0x00,0x00,0x05}},//电压校表
									{2, {0x08,0x00,0x00,0x05}},//读电压
									};

typedef struct
{
	INT8U hour;
	INT8U minute;
}TimeInfo;

typedef struct
{
	TimeInfo BeginT;//起始时间
	INT8U no;//费率号
}ShiDuanInfo;

//static ShiDuanInfo shiduanInfo[14] = {{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									{{0,0},3},//0:0，费率3
//									};

typedef struct
{
	INT8U month;
	INT8U day;
}DateInfo;

typedef struct
{
	DateInfo BeginD;//起始日期
	INT8U no;//时段号
}ShiQuInfo;

//static ShiQuInfo shiquInfo[14] = {{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								{{1,1},1},//1月1号，时段表号1
//								};

#endif /* DEF645_H_ */
