/*
 * usertype.h
 *
 *  Created on: 2013-8-19
 *      Author: yd
 */

#ifndef USERTYPE_H_
#define USERTYPE_H_
#include "stddef.h"
#include "../include/StdDataType.h"
//冻结数据保存
typedef struct
{
	INT16U crc;               //校验
	INT16U id_d;              //数据id
	INT16U id_mp;             //测量点号
	TS    tm_collect;        //抄表时间
	TS    tm_data;           //冻结时间
    INT8U  data[5+2];         //通用数据：xxxxxxxx.xxxx格式的bcd码
}FreezeData_SAVE;
typedef struct{
	int index;
	char name[50];
}UserType_t;

UserType_t tDaLei[16]={
		{0, "0未分类"},
		{1,"1专变"},
		{2,"2专变"},
		{3,"3低压三相"},
		{4,"4低压单相"},
		{5,"5居民用户"},
		{6,"6考核计量点"}
};
UserType_t tXiaoLei[16][16]={
		{{0,"未分类"}},//0
		{},//A
		{},//B
		//C
		{{0,"100A本地费控智能表"},{1,"100A远程费控智能表"},{2,"60A本地费控智能表"},{3,"60A远程费控智能表"},{4,"100A三相分时表"},
		 {5,"60A三相分时表"},{6,"100A三相卡表"},{7,"100A三相有功表"},{8,"60A三相卡表"},{9,"60A三相有功表"},{10,"简易多功能表"},{11,"多功能电表"},
		 {12,"智能电能表"}},
		 //D
		{{0,"80A本地费控智能表"},{1,"80A远程费控智能表"},{2,"60A本地费控智能表"},{3,"60A远程费控智能表"},{4,"80A单相分时表"},
		 {5,"60A单相分时表"}},
		 //E
		{{0,"100A本地费控智能表"},{1,"100A远程费控智能表"},{2,"60A本地费控智能表"},{3,"60A远程费控智能表"},{4,"100A三相分时表"},
		 {5,"60A三相分时表"},{6,"100A三相卡表"},{7,"100A三相有功表"},{8,"60A三相卡表"},{9,"60A三相有功表"},{10,"80A本地费控智能表"},{11,"80A远程费控智能表"},
		 {12,"60A本地费控智能表"},{13,"60A远程费控智能表"},{14,"80A单相分时表"},{15,"60A单相分时表"}},
		 //F
		{{0,"未分类"},{1,"I类计量装置"},{2,"II类计量装置"},{3,"I/II类计量装置"},{4,"III类计量装置"},{5,"III/IV类计量装置"}}
};

#endif /* USERTYPE_H_ */
