/*
 * SecureMode.c
 *
 *  Created on: 2017-1-13
 *      Author: gk
 */
#include <stdio.h>
#include <string.h>

#include "../include/StdDataType.h"

SecureUnit defaultSecurePara[]={{{0x0FFF,0x8004},3},//当前电量
														{{0x1FFF,0x4000},3},//最大需量
														{{0x202C,0x8004},0},//当前钱包文件
														{{0x202F,0x4180},0},//电能表主动上报
														{{0x2FFF,0x4040},3},//变量
														{{0x3FFF,0x4110},3},//事件
														{{0x4000,0x8184},0},//日期时间
														{{0x4001,0x8104},0},//通信地址
														{{0x4002,0x8404},0},//表号
														{{0x4003,0x4400},0},//客户编号
														{{0x400A,0x4500},0},//两套分时费率切换时间
														{{0x400B,0x4500},0},//两套阶梯切换时间
														{{0x401C,0x4500},0},//电流互感器变比
														{{0x401D,0x4500},0},//电压互感器变比
														{{0x401E,0x4500},0},//金额限值
														{{0x4018,0x4000},0},//当前套费率电价
														{{0x4019,0x4500},0},//备用套费率电价
														{{0x401A,0x4000},0},//当前套阶梯参数
														{{0x401B,0x4500},0},//备用套阶梯参数
														{{0x4111,0x8104},0},//备案号
														{{0x4FFF,0x4110},3},//参变量
														{{0x50FF,0x4100},2},//冻结
														{{0x60FF,0x8887},2},//采集监控
														{{0x70FF,0x8085},2},//集合
														{{0x80FF,0x4110},2},//控制
														{{0xF000,0x8110},0},//分帧传输
														{{0xF001,0x8220},0},//分块传输
														{{0xF002,0x8880},0},//扩展传输
														{{0xF100,0x8414},0},//ESAM
														{{0xF101,0x8124},0},//安全模式参数
														{{0xF2FF,0x8887},2},//输入输出接口设备
														{{0xFFFF,0x8887},2}//自定义
};
/*
 * 比较安全等级
 * 安全等级数值越小，等级越高
 * 输入： sclass终端存储对象等级，dclass主站下发报文安全等级
 * 输出：返回1，主站下发等级高于或等于终端存储等级，合格；返回0，低于终端存储等级，不合格，返回-1，发生错误
 */
INT8S SMode_CompareClass(INT8U sclass,INT8U dclass)
{
	if((sclass&dclass) == dclass || dclass !=0x00) return 1;//默认安全参数中，有的IO有2项，此处直接返回合格
	if(sclass ==0x00 || dclass==0x00) return -1;//默认安全参数里，有0x00项，代表不能操作，此处返回-1
	if((sclass&0x0F)<(dclass&0x0F)) return 0;
	else return 1;
}
/*
 * 输入：OADnum主站下发OAD数量。SMPara  F101属性3参数起始指针，paranum（属性3）个数
 */
INT8S SMode_GetClass(OAD *oad,SecureModePara* SMPara,INT16U paranum)
{

}
